app/controllers/tasks_controller.rb

  def index
    @tasks = Task.all.order(:completed, :created_at)
---
SELECT "tasks".* FROM "tasks" ORDER BY "tasks"."completed" ASC, "tasks"."created_at" ASC

  def show
    @task = Task.find_by(id: params[:id])
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    Task.create(task_params)
---
INSERT INTO "tasks" ("title", "description", "due_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Finish TaskList"], ["description", "blah"], ["due_date", "2018-09-23"], ["created_at", "2018-09-21 22:20:33.702951"], ["updated_at", "2018-09-21 22:20:33.702951"]]

  def destroy
    @task = Task.find_by(id: params[:id])
    @task.destroy
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 1]]

  def mark_complete
    @task = Task.find_by(id: params[:id])
    @task.toggle(:completed).save
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "tasks" SET "completed" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["completed", true], ["updated_at", "2018-09-24 19:11:25.935000"], ["id", 5]]